taskt/Core/Automation/Commands/WebBrowserGroup/ISeleniumCreateWebDriverProperties_[%reverse%].dot
digraph "taskt.Core.Automation.Commands.WebBrowserGroup.ISeleniumCreateWebDriverProperties" {
    rankdir="TB";
    node [
        shape="box",
        fontname="Meiryo UI",
        fontsize="12pt"
    ];

"taskt.Core.Automation.Commands.WebBrowserGroup.ASeleniumCreateWebDriverCommands" [ label="ASeleniumCreateWebDriverCommands", style="dashed", ];
"taskt.Core.Automation.Commands.WebBrowserGroup.ISeleniumCreateWebDriverProperties" [ label="ISeleniumCreateWebDriverProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.SeleniumBrowserAttachCreateWebBrowserInstanceCommand" [ label="SeleniumBrowserAttachCreateWebBrowserInstanceCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.SeleniumBrowserCreateWebBrowserInstanceCommand" [ label="SeleniumBrowserCreateWebBrowserInstanceCommand", shape="parallelogram", style="bold", ];

"taskt.Core.Automation.Commands.WebBrowserGroup.ASeleniumCreateWebDriverCommands" -> "taskt.Core.Automation.Commands.WebBrowserGroup.ISeleniumCreateWebDriverProperties";
"taskt.Core.Automation.Commands.SeleniumBrowserAttachCreateWebBrowserInstanceCommand" -> "taskt.Core.Automation.Commands.WebBrowserGroup.ASeleniumCreateWebDriverCommands";
"taskt.Core.Automation.Commands.SeleniumBrowserCreateWebBrowserInstanceCommand" -> "taskt.Core.Automation.Commands.WebBrowserGroup.ASeleniumCreateWebDriverCommands";
}
